{
  "posts": [
    {
      "id": 1,
      "title": "Como começar com Next.js",
      "summary": "Neste artigo, veremos como começar com o Next.js...",
      "created_at": "2023-09-01",
      "author": "João Silva",
      "content": "Next.js é um framework baseado em React que facilita a criação de aplicações modernas..."
    },
    {
      "id": 2,
      "title": "As novidades do JavaScript ES2023",
      "summary": "O ES2023 trouxe várias novas funcionalidades interessantes...",
      "created_at": "2023-09-02",
      "author": "Maria Souza",
      "content": "Entre as novidades do ES2023, podemos destacar os novos métodos de arrays..."
    },
    {
      "id": 3,
      "title": "Entendendo a arquitetura de microserviços",
      "summary": "Microserviços são uma forma de dividir aplicações em serviços menores...",
      "created_at": "2023-09-03",
      "author": "Carlos Pereira",
      "content": "A arquitetura de microserviços envolve a divisão de grandes aplicações monolíticas..."
    },
    {
      "id": 4,
      "title": "O que há de novo no Angular 16",
      "summary": "Angular 16 trouxe grandes melhorias de performance...",
      "created_at": "2023-09-04",
      "author": "Ana Costa",
      "content": "A última versão do Angular inclui melhorias como novas funcionalidades no Angular CLI..."
    },
    {
      "id": 5,
      "title": "Introdução ao TypeScript",
      "summary": "Neste tutorial, aprenderemos os conceitos básicos de TypeScript...",
      "created_at": "2023-09-05",
      "author": "Rafael Oliveira",
      "content": "TypeScript é um superconjunto de JavaScript que adiciona tipagem estática..."
    },
    {
      "id": 6,
      "title": "Melhores práticas em Docker",
      "summary": "Descubra as melhores práticas para trabalhar com containers Docker...",
      "created_at": "2023-09-06",
      "author": "Fernanda Lima",
      "content": "Quando se trabalha com Docker, é importante seguir boas práticas como..."
    },
    {
      "id": 7,
      "title": "GraphQL vs REST: Qual escolher?",
      "summary": "Vamos comparar GraphQL e REST para saber qual é a melhor escolha...",
      "created_at": "2023-09-07",
      "author": "Lucas Martins",
      "content": "GraphQL e REST são duas abordagens populares para APIs. Neste artigo, vamos analisar os prós e contras..."
    },
    {
      "id": 8,
      "title": "O que é JAMstack?",
      "summary": "JAMstack é uma arquitetura moderna para desenvolvimento web...",
      "created_at": "2023-09-08",
      "author": "Beatriz Silva",
      "content": "JAMstack refere-se a uma arquitetura de desenvolvimento web que usa JavaScript, APIs e Markup..."
    },
    {
      "id": 9,
      "title": "Como otimizar imagens para a web",
      "summary": "Neste guia, aprenderemos a otimizar imagens para melhorar o desempenho da sua página...",
      "created_at": "2023-09-09",
      "author": "Pedro Almeida",
      "content": "Imagens otimizadas são essenciais para uma boa performance na web. Técnicas como compressão e lazy loading..."
    },
    {
      "id": 10,
      "title": "Desenvolvimento Mobile com Flutter",
      "summary": "Saiba como começar a desenvolver aplicativos mobile com Flutter...",
      "created_at": "2023-09-10",
      "author": "Gabriela Santos",
      "content": "Flutter é um framework de código aberto da Google para criar aplicativos multiplataforma..."
    },
    {
      "id": 11,
      "title": "Boas práticas em UI/UX Design",
      "summary": "Aqui estão algumas dicas de boas práticas para criar interfaces de usuário eficazes...",
      "created_at": "2023-09-11",
      "author": "Renata Carvalho",
      "content": "Uma boa interface de usuário deve ser intuitiva, responsiva e acessível..."
    },
    {
      "id": 12,
      "title": "O que é Cloud Computing?",
      "summary": "Neste artigo, exploramos o conceito de Cloud Computing e seus benefícios...",
      "created_at": "2023-09-12",
      "author": "Diego Ribeiro",
      "content": "Computação em nuvem refere-se ao fornecimento de serviços de computação pela internet..."
    },
    {
      "id": 13,
      "title": "Integração contínua com Jenkins",
      "summary": "Saiba como configurar integração contínua com Jenkins...",
      "created_at": "2023-09-13",
      "author": "Carla Ferreira",
      "content": "Jenkins é uma ferramenta de integração contínua que permite automação do processo de build e deploy..."
    },
    {
      "id": 14,
      "title": "Testes unitários com Jest",
      "summary": "Aprenda a escrever testes unitários para suas aplicações usando Jest...",
      "created_at": "2023-09-14",
      "author": "Roberto Souza",
      "content": "Jest é uma biblioteca de testes para JavaScript, usada para escrever testes automatizados com facilidade..."
    },
    {
      "id": 15,
      "title": "O que é DevOps?",
      "summary": "Vamos entender o conceito de DevOps e como ele pode ajudar sua equipe...",
      "created_at": "2023-09-15",
      "author": "Bruno Mendes",
      "content": "DevOps é uma cultura e um conjunto de práticas que busca unificar o desenvolvimento e as operações de software..."
    },
    {
      "id": 16,
      "title": "Estratégias de SEO em 2023",
      "summary": "Veja as melhores estratégias de SEO para melhorar o ranking do seu site em 2023...",
      "created_at": "2023-09-16",
      "author": "Juliana Costa",
      "content": "As práticas de SEO estão sempre mudando. Em 2023, o foco está na experiência do usuário e em conteúdo de qualidade..."
    },
    {
      "id": 17,
      "title": "Introdução ao Machine Learning",
      "summary": "Vamos explorar o que é machine learning e como começar com essa tecnologia...",
      "created_at": "2023-09-17",
      "author": "Paulo Fonseca",
      "content": "Machine learning é uma área da inteligência artificial que permite que sistemas aprendam com dados..."
    },
    {
      "id": 18,
      "title": "Como proteger sua aplicação web",
      "summary": "A segurança é crucial para qualquer aplicação web. Veja como proteger a sua...",
      "created_at": "2023-09-18",
      "author": "Lucas Fernandes",
      "content": "Proteger uma aplicação web envolve várias práticas, como o uso de HTTPS, criptografia de dados e autenticação..."
    },
    {
      "id": 19,
      "title": "Acessibilidade na web",
      "summary": "Entenda como melhorar a acessibilidade de seus sites e aplicativos...",
      "created_at": "2023-09-19",
      "author": "Catarina Alves",
      "content": "A acessibilidade na web é fundamental para garantir que todos possam usar seu site, independentemente de suas habilidades..."
    },
    {
      "id": 20,
      "title": "Entendendo a web performance",
      "summary": "A performance da web é crucial para a experiência do usuário. Veja como melhorar o tempo de carregamento...",
      "created_at": "2023-09-20",
      "author": "Thiago Andrade",
      "content": "A performance web se refere à rapidez com que seu site ou aplicativo carrega e responde aos comandos do usuário..."
    },
    {
      "id": 21,
      "title": "O futuro da inteligência artificial",
      "summary": "Neste artigo, discutimos o futuro da IA e suas implicações...",
      "created_at": "2023-09-21",
      "author": "Felipe Ramos",
      "content": "A inteligência artificial está avançando rapidamente. As próximas décadas podem trazer mudanças drásticas nas indústrias..."
    },
    {
      "id": 22,
      "title": "O que é Kubernetes?",
      "summary": "Kubernetes é uma plataforma de orquestração de contêineres. Veja como ele funciona...",
      "created_at": "2023-09-22",
      "author": "Joana Ribeiro",
      "content": "Kubernetes permite a automação da implantação, escalabilidade e gerenciamento de aplicações em contêineres..."
    },
    {
      "id": 23,
      "title": "Serverless: O que é e como funciona",
      "summary": "Serverless é uma arquitetura em que o gerenciamento de servidores é abstraído. Veja os benefícios...",
      "created_at": "2023-09-23",
      "author": "Gustavo Lima",
      "content": "Com serverless, você se concentra apenas no código, enquanto o provedor de nuvem cuida da infraestrutura..."
    },
    {
      "id": 24,
      "title": "Introdução ao Vue.js",
      "summary": "Neste artigo, aprenderemos a começar com o framework Vue.js...",
      "created_at": "2023-09-24",
      "author": "Bruno Almeida",
      "content": "Vue.js é um framework progressivo para construção de interfaces de usuário. Ele é altamente adaptável e fácil de integrar..."
    },
    {
      "id": 25,
      "title": "Como melhorar a arquitetura de software",
      "summary": "Aprenda técnicas para melhorar a arquitetura do seu software e torná-lo mais escalável...",
      "created_at": "2023-09-25",
      "author": "Lucas Mendes",
      "content": "Uma boa arquitetura de software é essencial para a escalabilidade e manutenção de aplicações..."
    }
  ]
}